Revit 2027 API
RebarFreeFormAccessor.HasValidServer Method
 Returns true if the current rebar contains a valid server GUID, false otherwise.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasValidServer()
Public Function HasValidServer As Boolean
public:
bool HasValidServer()
member HasValidServer : unit -> bool
Return Value
Boolean
 Returns true if the current rebar contains a valid server GUID, false otherwise.
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace